Revit 2024 API
FillGrid Methods
The FillGrid type exposes the following members.
Methods
Name | Description
CalculateLengthPerArea
 Calculates length of the pattern per unit area.
CalculateLinesPerLength
 Calculates the number of solid lines of the pattern per unit length.
CalculateStrokesPerArea
 Calculates the number of the segments of the pattern per unit area.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetHatchingDirection
 Provides the hatching propagation. Hatching is inverted.
GetPointLineZone(UV)
 Gets the index of fill grid line closest to the input 2d point.
GetPointLineZone(UV, UV)
 Gets the index of fill grid line and the point on the grid line nearest to the input point.
GetSegmentDirection
 Provides the segment direction.
GetSegments
 Gets the segments of the fill grid.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsEqual
 Check if two fill grids are equal.
SetSegments
 Sets the segments to the fill grid.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
FillGrid Class
Autodesk.Revit.DB Namespace